<?php
use yii\helpers\Url;

$this->title = Yii::t('app', 'Guidelines');
?>
<h1>
    <?= $this->title ?>
</h1>
<p class="has-text-right is-italic">
    आखिरी अपडेट: २०२०-०४-१०
</p>
<p>
    एक सुरक्षित कम्युनिटी बनाने के लिए, कुछ नियम हैं जिनका आपको पालन करना होगा<br>
    DISBOARD का इस्तेनाल करके, आप इन नियमों से सहमत हो रहे हैं:
</p>
<ul>
    <li>
        सर्वर के मेटा (नाम, विवरण और तस्वीर), रिव्यू या किसी दूसरे ऐसे कंटेंट में गालियों, आपत्तिजनक शब्दों और NSFW (लैंगिक कंटेंट) का इस्तेमाल करना हमारे सहमति के हिसाब से मना है जो दूसरे DISBOARD उपयोगकर्ताओं द्वारा देखा जा सकता है। इसके चलते उस कंटेंट को हटा दिया जाएगा, पर आप इसे सही शब्दों में दोबारा पोस्ट कर पाएँगे।
    </li>
    <li>
        आप अपने राष्ट्र के कानूनों का उल्लंघन नहीं कर सकते और उनका उल्लंघन करने के विचार को भी बढ़ावा नहीं दे सकते।
    </li>
    <li>
        <a href="https://discordapp.com/guidelines" target="_blank">डिस्कॉर्ड कम्युनिटी नियमों</a> का उल्लंखन करने वाले सर्वरों की अनुमति नहीं है।
    </li>
    <li>
        DISBOARD में सर्वर बम्प करने (*ऑटो-बम्प*) जैसे काम करने के लिए बॉट या दूसरे स्क्रिप्टों का इस्तेमाल करना मना है। बम्प करने और रिव्यू लिखने जैसे काम मैन्युअल रूप से किए जाने चाहिए।
    </li>
    <li>
        सर्वरों को सिर्फ और सिर्फ दूसरे सर्वरों के विज्ञापन या उन्हें बढ़ावा देने के लिए जमा न करें या अगर उनमें कोई कंटेंट नहीं है (हमारे सहमति के हिसाब से)।
    </li>
    <li>
        आप DISBOARD पर उपयोगकर्ताओं को कुछ करने के लिए मजबूर नहीं कर सकते। उदाहरणस्वरूप, आप किसी सर्वर पर एक अच्छा रिव्यू लिखने के लिए इनाम नहींदे सकते या किसी सर्वर को बम्प करने के लिए मजबूर नहीं कर सकते।
    </li>
    <li>
        आप कई रिव्यू लिखने के लिए कई डिस्कॉर्ड अकाउंट नहीं बना सकते। एक व्यक्ति को १ ही रिव्यू देना चाहिए।
    </li>
    <li>
        सर्वर जिनका मुख्य आधार NSFW है (हमारे सहमति के हिसाब से लैंगिक कंटेंट) को DISBOARD पर "NSFW" के रूप में मार्क किया जाना चाहिए।
    </li>
</ul>

<p>
    हमारे <a href="<?= Url::to(['/site/tos']) ?>"><?= Yii::t('app', 'उपयोग की शर्तें'); ?></a> भी देखें
</p>
