<?php
use yii\helpers\Url;

$this->title = Yii::t('app', 'Guidelines');
?>
<h1>
    <?= $this->title ?>
</h1>
<p class="has-text-right is-italic">
    Последна измена: 2020-04-10
</p>
<p>
    Со цел да одржиме безбедна заедница, има одрени правила кои што треба да се почитуваат од твоја страна <br>
    Со користење на DISBOARD, ти се согласуваш на следните правила:
</p>
<ul>
    <li>
        Користење на погрдни, несоодветни зборови во наслов, опис, слики, рецензии или останати содржини кои можат да бидат видени од други корисници на DISBOARD е недозволено.
        Истото може да доведе до отстранување на содржината, но сепак ќе можете да ја објавите истата содржина корегирана.
    </li>
    <li>
        Не смее да се прекршат правилата или регулативите на државата во која престојуваш или да се промовира прекршување на истите.
    </li>
    <li>
        Серверите кои ги прекршуваат <a href="https://discordapp.com/guidelines" target="_blank">Discord правила</a> се недозволени.
    </li>
    <li>
        Користење на ботови и други скрипти за автоматско извршивање на акции на DISBOARD како подбуцнување на сервер ("автоматско подбуцнување") е недозволено.
        Подбуцнување, креирање рецензии и сл. мора да биде направено рачно.
    </li>
    <li>
        Не смее да се прикажуваат сервери кои служат за пренасочување или рекламирање на други сервери или кои немаат содржина.
    </li>
    <li>
        Не смее да наградуваш или да присилуваш корисници да извршуваат активности на DISBOARD. На пример не смее да се наградат корисници за објавување на добра рецензија за серверот
        или да се присилат да го подбуцнат истиот.
    </li>
    <li>
        Не смее да се креираат повеќе Discord профили за поднесување на повеќе рецензии. Ве молиме објавете само една рецензија.
    </li>
    <li>
        Сите сервери кои се базирани на сексуални содржини мора да бидат означени со "NSFW" на DISBOARD.
    </li>
</ul>

<p>
    Исто така погледни ги нашите <a href="<?= Url::to(['/site/tos']) ?>"><?= Yii::t('app', 'Услови за користење'); ?></a>
</p>
