<?php
use yii\helpers\Url;

$this->context->layout = 'focus';

$this->title = Yii::t('app', 'Guidelines');
?>
<h1>
    <?= $this->title ?>
</h1>
<p class="has-text-right">
    आखिरी संपादन: 10-04-2020
</p>
<p>
    एक सुरक्षित समुदाय बनाए रखने के लिए कुछ दिशानिर्देश हैं जिनका आपको पालन करना होगा<br>
    DISBOARD का इस्तेमाल करके आप इन दिशानिर्देशों को स्वीकार कर रहे हैं:
</p>
<ul>
    <li>
        हमारे फैसले पर DISBOARD के सर्वर के मेटा (नाम, विवरण और तस्वीर), प्रतिक्रिया या उपयोगकर्ताओं को दिखने वाली किसी भी दूसरी सामग्री में में गालियों, आपत्तिजनक शब्दों और NSFW (लैंगिक सामग्री) का उपयोग नहीं किया जा सकता। इससे सामग्री को हटा दिया जाएगा, लेकिन आप फिर से सही शब्दों के साथ सामग्री को पोस्ट कर सकेंगे।
    </li>
    <li>
        आप अपने राष्ट्र के कानूनों का उल्लंघन नहीं कर सकते और उनका उल्लंघन करने के विचार को भी बढ़ावा नहीं दे सकते।
    </li>
    <li>
        <a href="https://discord.com/guidelines" target="_blank">डिस्कॉर्ड के सामुदायिक नियमों</a> का उल्लंघन करने वाले सर्वरों की अनुमति नहीं है।
    </li>
    <li>
        DISBOARD पर सर्वर बम्प करने जैसे काम करने के लिए बॉट या दूसरे स्क्रिप्टों का इस्तेमाल ("ऑटो-बम्प") करना मना है। बम्प करने और प्रतिक्रियाएँ लिखने जैसे काम उपयोगकर्ता द्वारा किए जाने चाहिए।
    </li>
    <li>
        सर्वरों को सिर्फ और सिर्फ दूसरे सर्वरों के विज्ञापन या उन्हें बढ़ावा देने के लिए प्रस्तुत न करें या फिर अगर उनमें कोई सामग्री नहीं है (हमारे सहमति के हिसाब से)।
    </li>
    <li>
        आप DISBOARD पर उपयोगकर्ताओं को कुछ करने के लिए मजबूर नहीं कर सकते। उदाहरणस्वरूप, आप किसी सर्वर पर एक अच्छी प्रतिक्रिया लिखने के लिए इनाम नहीं दे सकते या किसी सर्वर को बम्प करने के लिए मजबूर नहीं कर सकते।
    </li>
    <li>
        आप कई प्रतिक्रियाएँ लिखने के लिए कई डिस्कॉर्ड अकाउंट्स नहीं बना सकते। हर व्यक्ति किसी सर्वर पर सिर्फ एक ही प्रतिक्रिया दे सकता है।
    </li>
    <li>
        मुख्य रूप से NSFW (हमारे फैसले पर लैंगिक सामग्री) पर आधारित सर्वरों को DISBOARD पर "NSFW" से टैग किया जाना चाहिए।
    </li>
</ul>

<p>
    हमारे <a href="<?= Url::to(['/site/tos']) ?>"><?= Yii::t('app', 'उपयोग की शर्तें'); ?></a> भी देखें।
</p>
