<?php
use yii\helpers\Url;

$this->title = 'उपयोग की शर्तें';
?>
<h1>
    <?= $this->title ?>
</h1>
<p class="has-text-right">
    आखिरी संपादन: 27-7-2020
</p>
<h2>परिचय</h2>
<p class="tos-summary">
    यह DISBOARD है। हमारे वेबसाइट का इस्तेमाल करके आप इन शर्तों को स्वीकार कर रहे हैं।
</p>
<ul>
    <li>
        ये उपयोग की शर्तें (यहाँ पर "शर्तें") उन शर्तों के वर्णित करती हैं जिनसे DISBOARD (यहाँ पर "हम") द्वारा प्रदान किए गए हमारे सेवा (यहाँ पर "सेवा") का सही उपयोग कैसे किया जा सकता है।
    </li>
    <li>
        इन शर्तों को DISBOARD वेबसाइट के उपयोग के लिए शर्तों के रूप में परिभाषित किया जा सकता है। DISBOARD वेबसाइट का इस्तेमाल करके उपयोगकर्ताएँ इन शर्तों को स्वीकार करते हैं।
    </li>
    <li>
        DISBOARD वेबसाइट का इस्तेमाल करने का मतलब यह है कि उपयोगकर्ताओं ने इन शर्तों को पढ़के स्वीकार किया है, अगर वे अपने क्षेत्राधिकार में उचित आयु के ऊपर है, या अगर वे अपने क्षेत्राधिकार में उचित आयु के नीचे हैं तो उनके कानूनी संरक्षकों ने इन शर्तों को पढ़के इन्हें स्वीकार किया है।
    </li>
</ul>

<h2>संपादन</h2>
<p class="tos-summary">हम शर्तों को किसी भी समय बदल सकते हैं, तो आपको इसे नियमित रूप से देखते रहना चाहिए।</p>
<ul>
    <li>
        हम इन शर्तों को किसी भी समय बदल सकते हैं, और उपयोगकर्ताओं को सूचना मिलने का कोई वादा नहीं है।
    </li>
    <li>
    अगर अतिरिक्त सूचना न दी गई हो तो शर्तों में बदलाव को तभी लागू किया जाएगा जब इसे DISBOARD वेबसाइट पर जोड़ा जाए।
    </li>
    <li>
        अगर कोई सदस्य शर्तों में बदलाव के बाद भी सेवा का इस्तेमाल जारी रखता है, इसका मतलब है कि वे शर्तों के नए संस्करण को भी स्वीकार कर रहे हैं।
    </li>
</ul>
</p>

<h2>निजता नीति</h2>
<p class="tos-summary">
इस निजता नीति में बताया गया है कि आप द्वारा हमारे वेबसाइट के उपयोग पर हमारा संगठन आपसे प्राप्त निजी डेटा का किस तरह से उपयोग करता है।
</p>

<h3>हमें कौन-सी डेटा प्राप्त होती है?</h3>
<p>DISBOARD निम्नलिखित डेटा प्राप्त करती है:</p>
<ul>
    <li>
        DISBOARD वेबसाइट पर क्रिया का लॉग
    </li>
    <li>
        डिस्कॉर्ड API द्वारा प्रदान की गई जानकारी, सिवाय ईमेल पते के
    </li>
</ul>

<h3>Minors</h3>
<p>
हमारी सेवाएँ 13 वर्ष के ऊपर के उपयोगकर्ताओं के लिए है और हम 13 वर्ष के नीचे के बच्चों से जान-बूझकर डेटा प्राप्त नहीं करेंगे। अगर आप 13 वर्ष के नीचे के किसी बच्चे के संरक्षक हैं या फिर आपको लगता है कि उसकी कुछ निजी जानकारी हमारे पास है, कृपया हमसे संपर्क करें। यूरोपीय आर्थिक क्षेत्र, जहाँ निजी जानकारी की प्राप्ति स्वीकार्यता पर निर्भर है, में रह रहे डेटा सुरक्षा नीति द्वारा स्थापित सहमति की उम्र के नीचे के नागरिकों से DISBOARD जान-बूझकर डेटा प्राप्त नहीं करेगी। अगर हमें पता लगता है कि हम ऐसा काम कर रहे हैं, हम प्रक्रिया बंद कर देंगे और हमारे रिकॉर्ड्स से सारी जानकारी हटाने के लिए कदम उठाएँगे।
</p>

<h3>हम आपके डेटा को कैसे प्राप्त करते हैं?</h3>
<p>
    आप ज़्यादातर डेटा खुद हमारी कंपनी को देते हैं। हम तभी डेटा प्राप्त करके प्रोसेस करेंगे जब आप:
</p>
<ul>
    <li>
        हमारे किसी भी सेवा के लिए ऑनलाइन पंजीकरण करते हैं।
    </li>
    <li>
        अपने फैसले पर एक सर्वर, प्रतिक्रिया, या प्रतिक्रिया पर जवाब जोड़ते हैं।
    </li>
    <li>
        ब्राउज़र की कुकीज़ की मदद से हमारे वेबसाइट को देखते हैं या इसका इस्तेमाल करते हैं।
    </li>
</ul>

<h3>हम आपके डेटा का इस्तेमाल कैसे करेंगे?</h3>
<p>
    हम प्राप्त किए गए डेटा का सिर्फ इन्हीं कार्यों के लिए इस्तेमाल करेंगे:
</p>
<ul>
    <li>
        हमारी सेवा को बढ़ावा देने के लिए।
    </li>
    <li>
        हमारे वैतनिक सेवाओं का इस्तेमाल करने वाले सदस्यों से पैसे लेने के लिए।
    </li>
    <li>
        सेवा के सुधार या सेवा नई सुविधा जोड़ने के लिए डेटा एककृत करने के लिए।
    </li>
    <li>
        उपयोग के दौरान इस सेवा के उपयोग की शर्तों के उल्लंघन को रोकने के लिए।
    </li>
    <li>
        उपयोगकर्ताओं के उपयोग के बारे में आँकड़ें पाने के लिए (इस तरह से डेटा को प्राप्त करते समय इसे इस तरह से प्रोसेस किया जाएगा कि डेटा के मालिक का पता न चले)।
    </li>
    <li>
        सदस्यों की स्थिति का पता लगाने के लिए ताकि इससे हमारी सेवाओं को सुधारा जा सके और इसे विकसित किया जा सके।
    </li>
    <li>
        हमारे द्वारा प्रदान किए जाने वाले सदस्यता वाले सेवाओं के बारे में जानकारी प्रदान करना।
    </li>
</ul>

<h3>हम आपके डेटा को कैसे रखते हैं?</h3>
<p>
हमारी कंपनी आपके डेटा को तृतीय-पक्ष होस्टिंग सुविधा पर सुरक्षित रखती है।<br>
हमारी कंपनी डेटा तब तक रखेगी जब तक आप उसे हटाने का अनुरोध न करें।
</p>

<h3>विपणन</h3>
<p>हम विपणन के लिए आपके डेटा का इस्तेमाल नहीं करते हैं।</p>

<h3>आपके डेटा सुरक्षा अधिकार क्या हैं?</h3>
<p>हमारी कंपनी यह सुनिश्चित करना चाहती है कि आप अपने सभी डेटा सुरक्षा अधिकारों से अनुकूल हैं। हर उपयोगकर्ता के ये अधिकार हैं:</p>
<ul>
    <?php /*
    <li>
        The right to access – You have the right to request Our Company for copies of your personal data. We may charge you a small fee for this service.
    </li>
    <li>
        The right to rectification – You have the right to request that Our Company correct any information you believe is inaccurate. You also have the right to request Our Company to complete the information you believe is incomplete.
    </li>
    */ ?>
    <li>
        हटने का अधिकार – आपके पास यह अनुरोध करने का अधिकार है कि हमारी कंपनी आपके निजी डेटा को हटा दें, मगर कुछ शर्तों पर।
    </li>
    <li>
        प्रोसेसिंग रोकने का अधिकार – आपके पास यह अनुरोध करने का अधिकार है कि हमारी कंपनी आपके निजी डेटा को प्रोसेस करना बंद कर दें, मगर कुछ शर्तों पर।
    </li>
    <?php /*
    <li>
        The right to object to processing – You have the right to object to Our Company’s processing of your personal data, under certain conditions.
    </li>
    <li>
        The right to data portability – You have the right to request that Our Company transfer the data that we have collected to another organization, or directly to you, under certain conditions.
    </li>
    */ ?>
    <li>
        अगर आप कोई अनुरोध करते हैं, हम एक महीने के अंदर आपको जवाब देंगे। अगर आप इनमें से किसी भी अधिकार का इस्तेमाल करना चाहेंगे, हमसे संपर्क करें।
    </li>
</ul>

<h3>कुकीज़</h3>
<p>
कुकीज़ टेक्स्ट फाइलें हैं जो मानक इंटरनेट लॉग जानकारी और अतिथि के स्वभाव की जानकारी रखने के लिए आपके कंप्यूटर पर रखी जाने वाली टेक्स्ट फाइलें होती हैं। जब आप हमारे वेबसाइट पर आते हैं, हम स्वचालित रूप से कुकीज़ या संबंधित तकनीकों से आपकी जानकारी प्राप्त कर सकते हैं। उपयोगकर्ताओं के बीच विवादों से कंपनी का कोई संबंध नहीं है।
अधिक जानकारी के लिए https://allaboutcookies.org देखें।
</p>

<h4>हम कुकीज़ का इस्तेमाल कैसे करते हैं?</h4>
<p>
    हमारी कंपनी हमारे वेबसाइट पर आपके अनुभव को सुधारने के लिए कई तरीकों से कुकीज़ का इस्तेमाल करती है, जैसे:
</p>
<ul>
    <li>
        आपको साइन-इन किया हुआ रखना
    </li>
    <li>
        यह समझना कि आप हमारे वेबसाइट का इस्तेमाल कैसे करते हैं
    </li>
</ul>

<h4>हम किस तरह के कुकीज़ का इस्तेमाल करते हैं?</h4>
<p>कई तरह की कुकीज़ हैं, मगर हमारे वेबसाइट पर सिर्फ इन्हीं का इस्तेमाल होता है:</p>
<ul>
    <li>
        कार्यक्षमता - DISBOARD इन कुकीज़ का इस्तेमाल करती है ताकि हम वेबसाइट पर आपके लॉग-इन की जानकारी को जाँच पाएँ और आप द्वारा पहले चुने गए वरीयताओं को याद रख पाएँ। इसमें शामिल हो सकता है, आपकी चुनी हुई भाषा। प्रथम-पक्ष और तृतीय-पक्ष कुकीज़ का इस्तेमाल साथ में किया जाता है।
    </li>
    <li>
        प्रदर्शन - इन कुकीज़ से DISBOARD हमारे सेवाओं को सुधारता है।
    </li>
</ul>

<h3>Google Analytics</h3>
<p>
    इस बारे में जानकारी इकट्ठा करने के लिए कि अतिथि हमारे वेबसाइट का इस्तेमाल किस तरह से करते हैं, हम इस वेबसाइट पर Google Analytics का इस्तेमाल करते हैं। आप Google Analytics के बारे में, और इस बारे में जानकारी Google Analytics के उपयोग की शर्तों तथा Google की निजता नीति पर पा सकते हैं, कि यह काम कैसे करता है।
</p>
<ul>
    <li>
        Google Analytics के उपयोग की शर्तें
        https://marketingplatform.google.com/about/analytics/terms/us/
    </li>
    <li>
        Google की निजता नीति
        https://policies.google.com/privacy
    </li>
</ul>
<p>
    Google Analytics से बाहर निकलने के लिए कृपया नीचे के URL से "Opt-out Browser Add-on" डाउनलोड कर लें। इसे स्थापित करने के बाद आप Google Analytics के सेटिंग्स को संपादित कर पाएँगे।
    Google Analytics Opt-out Browser Add-on
    https://tools.google.com/dlpage/gaoptout
</p>

<h3>reCaptcha</h3>
<p>
    हम इस साइट पर प्रस्तुति फॉर्म्स की मदद से आपके प्रस्तुत किए गए डेटा को सुरक्षित रखने के लिए Google Inc. (Google) द्वारा प्रदान किए जाने वाले reCAPTCHA सेवा का इस्तेमाल करते हैं। यह प्लगिन यह जाँचता है कि आप मानव है कि नहीं, ताकि स्पैम बॉट्स कुछ सुविधाओं का (दुर्)उपयोग न कर पाए। इस प्लगिन क्वेरी में शामिल है IP पते और संभवतः दूसरे डेटा को Google को भेज देता है जिससे वे reCAPTCHA सेवा को चला पाए। इस काम के लिए आपके डेटा को Google जाँचेगी। लेकिन आपके IP पते को यूरोपीय संघ के सदस्य राष्ट्रों या दूसरे देशों में Google द्वारा छोटा कर दिया जाता है जो यूरोपीय आर्थिक क्षेत्र के सदस्य हैं, जिससे उन्हें गुमनाम बना दिया जाता है। सिर्फ कुछ ही मामलों में संयुक्त राज्य के Google सर्वर को पूरा IP पता भेजा जाता है और उसे वहीं छोटा किया जाता है। इस वेबसाइट के चालक की ओर से Google इस जानकारी से इस सेवा के आपके उपयोग का पता लगाएगी। आपको ब्राउज़र से reCaptcha को दी गई डेटा को Google के किसी और डेटा से मिश्रित नहीं किया जाएगा।
</p>

<h3>कुकीज़ कैसे प्रबंधित करें</h3>
<p>
    आप अपने ब्राउज़र पर सेटिंग लगा सकते हैं ताकि कुकीज़ स्वीकार न की जाए, और उपरोक्त वेबसाइट में लिखा है कि आप अपने ब्राउज़र से कुकीज़ कैसे हटा सकते हैं। हालाँकि, कुछ मामलों में कुकीज़ हटाने पर शायद हमारे वेबसाइट की कुछ सुविधाएँ ठीक से काम न करे।
</p>

<h3>दूसरे वेबसाइटों की निजता नीतियाँ</h3>
<p>
   DISBOARD.org वेबसाइट पर दूसरे वेबसाइटों की कड़ियाँ हैं। हमारी निजता नीति सिर्फ हमारे वेबसाइट पर लागू होती है, तो अगर आप किसी दूसरे वेबसाइट की कड़ी पर क्लिक करते हैं, आपको उनकी निजता नीति भी पढ़नी चाहिए।
</p>

<h3>निजता नीति पर बदलाव</h3>
<p>
    DISBOARD अपनी निजता नीति को नियमित रूप से जाँचती है और इस वेब पृष्ठ पर सभी अद्यतनों को रखती है। इस निजता नाति को आखिरी बार उस दिनांक पर संपादित किया गया था जो पृष्ठ के ऊपर की तरफ लिखा है।
</p>

<h3>हमसे संपर्क कैसे करें</h3>
<p>
    अगर आपके पास हमारे कंपनी की निजता नीति या हमारे पास मौजूद आपकी डेटा को लेकर कोई सवाल है, या फिर आप अपने सुरक्षा अधिकारों में से किसी एक का इस्तेमाल करना चाहते हैं, कृपया हमसे संपर्क ज़रूर करें।<br>
    डिस्कॉर्ड सर्वर: <a href="<?= Yii::$app->params['discordServer']['en'] ?>"><?= Yii::$app->params['discordServer']['en'] ?></a> (मालिक: Taki#0526) <br>
    (नोट: सवाल पूछते समय कृपया अपने सवाल की सामग्री भी प्रदान करें। अगर आपके प्रश्न पर विवरण न हो तो हो सकता है कि हम उसका ठीक से जवाब न दे पाए।)
</p>

<h3>कैलिफ़ोर्निया के नागरिकों के लिए</h3>
<p>
    DISBOARD समय के साथ और तृतीय-पक्ष वेबसाइटों पर लक्षित विज्ञापन दिखाने के लिए अपने ग्राहकों को ट्रैक नहीं करता है और इसलिए "Do Not Track" ("ट्रैक न करें") सिग्नल्स का जवाब नहीं देता है। हालाँकि, कुछ तृतीय पक्ष साइटें आपको सामग्री प्रदान करते समय आपके ब्राउज़ करने की क्रिया को ट्रैक करते हैं, जिससे वे आपको दिखाए जाने वाली सामग्री को अनुकूलित कर पाते हैं। अगर आप ऐसे साइटों पर जाते हैं, यह आपकी ज़िम्मेदारी है कि आप अपने ब्राउज़र पर DNT सिग्नल्स सक्षम करें।
</p>

<h2>सदस्यता के अस्वीकृति का अधिकार</h2>
<p class="tos-summary">
    हम आपके पंजीकरण को अस्वीकार कर सकते हैं।
</p>
<ul>
    <li>
        इन शर्तों से सहमत कोई भी व्यक्ति इस सेवा का इस्तेमाल करने के लिए DISBOARD द्वारा प्रदान किए गए पंजीकरण उपकरणों की मदद से सदस्यता का आवेदन भेज सकता है।
    </li>
    <li>
        सेवा के लिए आवेदन भेज रहा कोई भी व्यक्ति (यहाँ पर "आवेदक") आवेदन को स्वीकार किए जाने के बाद एक उपयोगकर्ता बन जाता है।
    </li>
    <li>
        हम इन मामलों में कारण को सार्वजनिक किए बिना किसी आवेदक से आवेदन फॉर्म को अस्वीकार करने का फैसला ले सकते हैं:
        <ul>
            <li>
                आवेदक ने धारा 2 में वर्णित माध्यम से आवेदन नहीं किया।
            </li>
            <li>
                आवेदक को शर्तों का उल्लंघन करने की वजह से सेवा से हटा दिया गया है।
            </li>
            <li>
                हमने आवेदन को आपत्तिजनक पाया।
            </li>
        </ul>
    </li>
</ul>

<h2>उपयोगकर्ता पर्यावरण का अनुरक्षण</h2>
<p class="tos-summary">
    आप अपने खाते/संपत्ति के लिए ज़िम्मेदार हैं।
</p>
<ul>
    <li>
        उपयोगकर्ता को उसके खर्च और ज़िम्मेदारी पर इस सेवा का उपयोग करने के लिए उचित हार्डवेयर रखना होगा।
    </li>
    <li>
        उपयोगकर्ता को अपने डिवाइस को वायरस, अप्रमाणित पहुँच, या जानकारी के रिसाव से बचाने के लिए उचित कदम उठाने चाहिए।
    </li>
    <li>
        उपयोगकर्ता के निजी पर्यावरण और निजी संपत्ति के साथ हमारा कोई संबंध नहीं है।
    </li>
</ul>

<h2>उपयोगकर्ता की ज़िम्मेदारी</h2>
<p class="tos-summary">
    आप अपने कार्यों के लिए ज़िम्मेदार हैं।
</p>
<ul>
    <li>
        उपयोगकर्ता इस सेवा के उपयोग के लिए तथा इस सेवा के उपयोग के परिणाम में हुए क्रियाओं के लिए ज़िम्मेदार है।
    </li>
    <li>
        उपयोगकर्ता उस सभी डेटा के लिए ज़िम्मेदार है जो वह इस सेवा पर पोस्ट करते है। हम किसी भी सामग्री के लिए ज़िम्मेदार नहीं हैं जो उपयोगकर्ता सेवा पर पोस्ट करते है।
    </li>
    <li>
        अगर उपयोगकर्ता मानहानिकारक तरीके से व्यवहार करते है, गोपनीयता के अधिकार का उल्लंघन करते है, बिना अनुमति के तृतीय-पक्ष की जानकारी का खुलासा करते है या कॉपीराइट कानूनों का उल्लंघन करते है, उसे अपने कार्यों का भार उठाना होगा। हम कोई ज़िम्मेदारी नहीं लेते।
    </li>
</ul>

<h2>निषिद्ध क्रियाएँ</h2>
<p class="tos-summary">
    कुछ चीज़ें हैं जो आप इस वेबसाइट पर नहीं कर सकते, और वे नीचे सूचीबद्ध हैं।
</p>
<p>
    नीचे सूचीबद्ध कार्य इस सेवा पर प्रतिबंधित हैं। अगर कोई उपयोगकर्ता प्रतिबंधित कार्य करता है, हम उनके सदस्यता को रोक सकते हैं, खाते से डेटा के कुछ हिस्से या पूर्ण डेटा को मिटा सकते हैं, या उपयोगकर्ता के प्रकाशन सीमा को बदल सकते हैं।
    (मगर हम ये कदम उठाने को मजबूर नहीं हैं और इन कदमों को उठाने के कारण को सार्वजनिक करने के लिए भी मजबूर नहीं हैं।)
</p>
<ul>
    <li>
        <a href="<?= Url::to(['/site/guidelines']) ?>">दिशानिर्देशों</a> का उल्लंघन करना
    </li>
    <li>
        ऐसी सामग्री वाली डेटा पोस्ट करना:
        <ul>
            <li>
               बाल रतिचित्रण या बाल शोषण, जो कानूनों और नीतियों का उल्लंघन करता हो।
            </li>
            <li>
                जानकारी जिससे किसी का अपमान हो।
            </li>
            <li>
                व्यक्तिगत रूप से पहचानने-योग्य जानकारी।
            </li>
            <li>
                जानकारी जो हमें आपत्तिजनक लगे।
            </li>
        </ul>
    </li>
    <li>
        इस साइट के सृष्टिकार या हमारी अनुमति के बिना से डेटा का पुनःप्रकाशन।
    </li>
    <li>
        कोई भी कार्य जो नीतियों, नैतिकता, नियम या अन्य शर्तों का उल्लंघन करे, या फिर जिसे हम मानें कि वह दूसरों के अधिकारों का उल्लंघन करता है।
    </li>
    <li>
        लंबे समय तक सर्वर पर बोझ बनाना या सेवा के प्रदर्शन या नेटवर्क सिस्टम को क्षति पहुँचाना।
    </li>
    <li>
        कोई भी दूसरा कार्य जिसे हमारी कंपनी आपत्तिजनक माने।
    </li>
</ul>

<h2>सेवा में बदलाव</h2>
<p class="tos-summary">
    हम किसी भी समय इस सेवा को बदल सकते हैं/खत्म कर सकते हैं, और हम इसके ज़िम्मेदार नहीं हैं।
</p>
<ul>
    <li>
        हम पूर्व सूचना के बिना किसी भी समय सेवा में कुछ जोड़ सकते हैं, इसे बदल सकते हैं, रोक सकते हैं और/या अवरोधित भी कर सकते हैं।
    </li>
    <li>
        हम सेवा में किसी बदलाव, रोक, या अवरोध के लिए ज़िम्मेदार नहीं हैं।
    </li>
</ul>

<h2>शुल्क</h2>
<p>
    DISBOARD निःशुल्क है।<br>
    प्रीमियम सेवा का योजना बन रही है। उस मामले में इसे प्रीमियम सेवा के उपयोग की शर्तों में अलग से दर्ज किया जाएगा।
</p>

<h2>डेटा का अधिकार</h2>
<p class="tos-summary">
    जो भी आप पोस्ट करते हैं, वह आपका ही है। विवादों के मामले में आप इसे खत्म करेंगे। हमें लड़ाई में न खींचें।
</p>
<p>
    डेटा को पोस्ट करने वाले उपयोगकर्ता का यह वादा होना चाहिए कि यह किसी तृतीय-पक्ष के अधिकारों का उल्लंघन नहीं करता है। अगर डेटा को पोस्ट करने की वजह से किसी तृतीय-पक्ष के अधिकार के उल्लंघन के बारे में विवाद पैदा होती है, उपयोगकर्ता को अपने खर्च और ज़िम्मेदारी पर विवाद को सुलझाना होगा। उपयोगकर्ता हमारी कंपनी को कोई क्षति नहीं पहुँचा सकता।
</p>

<h2>Data License</h2>
<p class="tos-summary">
    यह सेवा हमारा है। आप हमें आपकी डेटा का उपयोग करने की अनुमति देते हैं। हम इसे नियमित रूप से जाँच सकते हैं।
</p>
<ul>
    <li>
        इस सेवा से जुड़ी बौद्धिक संपदा अधिकार और जानकारी, सेवा, प्रोग्राम, आदि से संबंधित दूसरे अधिकार हमारे हैं।
    </li>
    <li>
        इस सेवा पर पोस्ट की गई हर डेटा का कॉपीराइट उस उपयोगकर्ता के पास है जिसने वह टेक्स्ट और/या चित्र बनाया हो। DISBOARD वेबसाइट पर कोई भी डेटा पोस्ट करके उपयोगकर्ता हमें एक शाश्वत, विश्वव्यापी, रॉयल्टी मुक्त, अपरिवर्तनीय लाइसेंस प्रदान करते हैं जिसके अंतर्गत हम DISBOARD वेबसाइट के लक्षित सेवाओं को प्रदान करने के लिए डेटा को संचारित कर सकते हैं, रख सकते हैं, संशोधित कर सकते हैं और प्रदर्शित कर सकते हैं।
    </li>
    <li>
        हमारी कंपनी हमारे सेवा के चलते रहने और/या उचित ढंग से हमारे सिस्टम को सुधारने और अनुरक्षित करने के लिए डेटा को संशोधित और डेटा का इस्तेमाल कर सकती है।
    </li>
</ul>

<h2>अस्वीकरण</h2>
<p class="tos-summary">
    हम क्षति के लिए ज़िम्मेदार नहीं हैं। गलती कोई बहाना नहीं है।
</p>
<ul>
    <li>
        उपयोगकर्ताओं के बीच विवादों से कंपनी का कोई संबंध नहीं है। अगर उपयोगकर्ताओं के बीच विवाद होती है, उपयोगकर्ताओं को उनकी ज़िम्मेदारी पर इसे सुलझाना होगा। उपयोगकर्ताओं के बीच विवादों पर हम कोई ज़िम्मेदारी नहीं लेते हैं।
    </li>
    <li>
        हम किसी भी समय सेवा को संशोधित कर सकते हैं, रोक सकते हैं या अवरोधित कर सकते हैं जब इसे आवश्यक माना जाए। हम इस सेवा से हुई किसी भी क्षति पर कोई ज़िम्मेदारी नहीं लेते हैं। साथ ही, सर्वर पर ज़्यादा बोझ या दूसरे अनपेक्षित कारणों से सिस्टम में हुई खराबी के लिए भी हम कोई ज़िम्मेदारी नहीं लेते हैं।
    </li>
    <li>
        हम किसी उपयोगकर्ता द्वारा प्रदान किए जाने वाले डेटा को रखने पर मजबूर नहीं हैं।
    </li>
    <li>
        साइट पर किसी उपयोगकर्ता द्वारा अपलोड की या बनाई गई किसी भी सामग्री के लिए Disboard ज़िम्मेदार नहीं है। अगर कोई ऐसी सामग्री अपलोड की जाती है जो अवैध है या फिर इन शर्तों का उल्लंघन करती है, Disboard उचित कदम उठाएगी, मगर Disboard ऐसी सामग्री के लिए कोई ज़िम्मेदारी नहीं लेगी जिसे हटाया न गया हो।
    </li>
    <li>
        अगर हमारे पास सबूत हो कि उपयोगकर्ता ने शर्तों का उल्लंघन किया है, हम सदस्यता को रोक या अवरोधित कर सकते हैं, डेटा के कुछ हिस्से या पूर्ण डेटा को हटा सकते हैं या उपयोगकर्ता के प्रकाशित सीमा को बदल सकते हैं। इस कार्य से हुए किसी भी क्षति की ज़िम्मेदारी हम नहीं लेते।
    </li>
    <li>
       इन शर्तों के किसी भी अधिकार या प्रावधान को लागू करने या लागू करने में हमारी विफलता ऐसे अधिकार या प्रावधान की छूट का वादा नहीं करेगी, और इसके तहत किसी भी उल्लंघन में के किसी भी पक्ष द्वारा किसी भी छूट को किसी पूर्ववर्ती या बाद के ब्रीच या फिर डिफॉल्ट से छूट नहीं माना जाएगा।
    </li>
</ul>

<h2>उपयोग की शर्तों की वैधता</h2>
<p class="tos-summary">
    अगर नीति, या व्यक्तिगत अनुबंध का कोई भी हिस्सा शर्तों के दूसरे हिस्से को अवैध घोषित करता है, दूसरे हिस्से फिर भी लागू होंगे।
</p>
<ul>
    <li>
        अगर न्यायालय में इन शर्तों के किसी भी हिस्से को अवैध माना जाता है, शर्तों का बाकी हिस्सा फिर भी पूरी तरह से लागू होगा।
    </li>
    <li>
        अगर हम शर्तों के किसी भी हिस्से को किसी उपयोगकर्ता के साथ लिखित अनुबंध के ज़रिए अवैध घोषित करते हैं, शर्तों का बाकी हिस्सा फिर भी पूरी तरह से लागू होगा।
    </li>
</ul>

<h2>निषिद्ध कार्यों की प्रक्रिया</h2>
<p class="tos-summary">
    अगर आप हमारे नियम तोड़ते हैं तो आपको इस तरह से सज़ा मिलेगी
</p>
<ul>
    <li>
        अगर यह पाया जाता है कि उपयोगकर्ता ने इन शर्तों और उपयोग की दूसरी शर्तों आदि का उल्लंघन किया है और कुछ मामलों में, अगर हम इसे आवश्यक समझते हैं, तो हम निम्नलिखित में से उपाय ला सकते हैं। हालाँकि, हम ये उपाय लाने के लिए मजबूर नहीं हैं और हम इन उपायों को लाने के कारण का खुलासा करने के लिए कोई ज़िम्मेदारी नहीं मानते हैं।
        <ul>
            <li>
                डेटा को हटाने या सुधारने का अनुरोध करना।
            </li>
            <li>
                डेटा का हिस्से या पूर्ण डेटा को हटाना, प्रकाशन के क्षेत्र को बदलना या ब्राउज़िंग अक्षम करना।
            </li>
            <li>
                सेवा तक उपयोगकर्ता की पहुँच को बदलना।
            </li>
            <li>
                सदस्यता को रोकने के लिए अनिवार्य अवरोध।
            </li>
            <li>
                सदस्यता को स्वीकार करने से मना करना।
            </li>
        </ul>
    </li>
    <li>
        उपयोगकर्ता को हमारे उपायों पर कोई आपत्ति नहीं होगी।
    </li>
    <li>
        DISBOARD इस खंड में उल्लिखित कार्यों को करने में उपयोगकर्ताओं के साथ मुआवजा या समझौता करने के लिए मजबूर नहीं है।
    </li>
</ul>
