<?php
use yii\helpers\Url;

$this->title = Yii::t('app', 'Terms of Service');
?>
<h1>
    <?= $this->title ?>
</h1>
<p class="has-text-right is-italic">
    最終更新日: 2020-07-27
</p>
<h2>前書き</h2>
<p class="tos-summary">
    これはDISBOARDです。当社のウェブサイトを使用することにより、以下の条件に同意したことになります。
</p>
<ul>
    <li>
        以下の利用規約（以下「規約」）は、DISBOARDが提供する当社のサービス（以下「本サービス」）の適切な使用を定義する条件を示しています。（以下「私たち」、「私たち」、「私たち」）。
    </li>
    <li>
        この条件は、DISBOARD Webサイトの使用条件として定義されています。DISBOARD Webサイトを使用することにより、ユーザーはこれらの条件に従うことに同意します。
    </li>
    <li>
        DISBOARD Webサイトの使用は、ユーザーが成年を超えていることを条件に、ユーザーがこれらの条件を読んで同意したとみなします。
    </li>
</ul>

<h2>本規約の変更</h2>
<p class="tos-summary">これらの条件はいつでも変更できるため、定期的に確認する必要があります。</p>
<ul>
    <li>
        当社は、ユーザーへの通知の有無にかかわらず、これらの規約をいつでも修正および更新することができます。
    </li>
    <li>
        条件の変更は特に明記しない限り、DISBOARD Webサイトで更新されたときに有効になります。
    </li>
    <li>
        ユーザーが本規約の変更後も引き続きサービスを使用する場合、ユーザーは本規約の最新版に拘束されるものとします。
    </li>
</ul>
</p>

<h2>プライバシーポリシー</h2>
<p class="tos-summary">
このプライバシーポリシーは、お客様が当社のWebサイトを使用する際に、当社がお客様から収集した個人データを当社がどのように使用するかを説明します。
</p>

<h3>どのようなデータを収集しますか？</h3>
<p>DISBOARDは次のデータを収集します。</p>
<ul>
    <li>
        DISBOARD Webサイトのアクティビティログ
    </li>
    <li>
        Discord APIが提供する情報（メールアドレスを除く）
    </li>
</ul>

<h3>未成年者</h3>
<p>
    当社のサービスは13歳以上のユーザーを対象としており、13歳未満の子供から意図的に個人情報を収集することはありません。13歳未満の子供の親または保護者であり、個人情報を開示したと思われる場合お問い合わせください。個人情報の処理が同意に基づいているEEAの居住者の場合、DISBOARDは、適用されるデータ保護法で定められた同意年齢未満のユーザーに対して、その処理に故意に関与しません。そのようなユーザーとその処理を行っていることがわかった場合、その処理を停止し、記録から該当する情報を速やかに削除するための合理的な措置を講じます。
</p>

<h3>どのようにデータを収集しますか？</h3>
<p>
    あなたは、当社が収集するほとんどのデータを当社に直接提供します。次の場合にデータを収集し、データを処理します。
</p>
<ul>
    <li>
        当社のサービスにログインしたとき
    </li>
    <li>
        サーバーの追加、レビュー、レビューへの返信をしたとき
    </li>
    <li>
        ブラウザーのCookieを使用してWebサイトを使用または表示したとき
    </li>
</ul>

<h3>データをどのように使用しますか？</h3>
<p>
    受け取った個人情報は、次の目的でのみ使用します。
</p>
<ul>
    <li>
        サービスを提供するため。
    </li>
    <li>
        有料サービスを使用するユーザーに請求するため。
    </li>
    <li>
        既存または新しいサービスの改善のため。
    </li>
    <li>
        このサービスの利用規約に違反する使用を防ぐため。
    </li>
    <li>
        ユーザーの使用状況に関する統計データを収集するため（このようなデータを収集する場合、個人を特定しないようにデータを変更するものとします）。
    </li>
    <li>
        ユーザーの使用状況を把握し、このサービスの改善と新しいサービスの開発に使用するため。
    </li>
    <li>
        さまざまな会員サービスおよびその他のさまざまなサービスに関する情報を提供するため。
    </li>
</ul>

<h3>データをどのように保存しますか？</h3>
<p>
当社は、サードパーティのホスティング施設にお客様のデータを安全に保存します。 <br>
当社は、お客様が削除を明示的に要求するまでお客様のデータを保持します。
</p>

<h3>マーケティング</h3>
<p>マーケティング目的でデータを配布することはありません。</p>

<h3>データ保護の権利は何ですか？</h3>
<p>
    当社は、お客様がすべてのデータ保護権を完全に認識できるようにしたいと考えています。すべてのユーザーには次の権利があります。
</p>
<ul>
    <?php /*
    <li>
        アクセスする権利-あなたはあなたの個人データのコピーを当社に要求する権利があります。このサービスに対して少額の料金を請求する場合があります。
    </li>
    <li>
        修正する権利–不正確と思われる情報を修正するよう当社に要求する権利があります。また、不完全と思われる情報の入力を当社に依頼する権利もあります。
    </li>
    */ ?>
    <li>
        消去する権利–お客様には、特定の条件下で、当社にお客様の個人データを消去するよう要求する権利があります。
    </li>
    <li>
        処理を制限する権利–お客様には、特定の条件下で、当社にお客様の個人データの処理を制限するよう要求する権利があります。
    </li>
    <?php /*
    <li>
        処理に異議を唱える権利–一定の条件下で、当社が個人データを処理することに異議を唱える権利があります。
    </li>
    <li>
        データの移植性の権利–お客様には、特定の条件下で、当社が収集したデータを別の組織に、または直接お客様に転送するよう当社に要求する権利があります。
    </li>
    */ ?>
    <li>
        リクエストを行った場合、1か月以内に返信します。これらの権利のいずれかを行使する場合は、ご連絡ください。
    </li>
</ul>

<h3>クッキー</h3>
<p>
    Cookieは、標準のインターネットログ情報と訪問者の行動情報を収集するためにコンピューターに配置されるテキストファイルです。お客様が当社のウェブサイトにアクセスすると、クッキーまたは同様の技術を通じて自動的に情報を収集する場合があります。詳細については、https://allaboutcookies.org にアクセスしてください。
</p>

<h4>クッキーの使用方法</h4>
<p>
    当社は、以下を含むさまざまな方法でクッキーを使用して、当社のウェブサイトでのユーザー体験を改善しています。
</p>
<ul>
    <li>
        サインインしたままにする
    </li>
    <li>
        ウェブサイトの使用方法を理解する
    </li>
</ul>

<h4>どの種類のCookieを使用しますか？</h4>
<p>
    Cookieにはさまざまな種類がありますが、当社のWebサイトでは以下を使用しています。
</p>
<ul>
    <li>
        機能-DISBOARDはこれらのCookieを使用して、ウェブサイト上のログイン情報を認識し、以前に選択した設定を記憶します。これらには、あなたが好む言語が含まれます。ファーストパーティCookieとサードパーティCookieの混合が使用されます。
    </li>
    <li>
        パフォーマンス-DISBOARDはこれらのCookieを使用してサービスを改善します。
    </li>
</ul>

<h3>Google Analytics</h3>
<p>
    訪問者が当社のウェブサイトをどのように使用しているかに関する情報を収集し、当社のサービスの機能を改善するために、当社はこのウェブサイトでGoogle Analyticsを使用しています。Googleアナリティクスの仕組みと、Googleアナリティクスの利用規約とGoogleプライバシーポリシーに関する情報の収集方法について詳しく知ることができます。
</p>
<ul>
    <li>
        Google Analytics利用規約 <br>
        https://marketingplatform.google.com/about/analytics/terms/us/
    </li>
    <li>
        Google プライバシーポリシー <br>
        https://policies.google.com/privacy
    </li>
</ul>
<p>
    Google Analyticsをオプトアウトするには、以下のURLから「オプトアウトブラウザーアドオン」をダウンロードしてください。インストールすると、Googleアナリティクスの設定を編集できるようになります。Google Analyticsオプトアウトブラウザーアドオン https://tools.google.com/dlpage/gaoptout
</p>

<h3>reCaptcha</h3>
<p>
    Google Inc.（Google）が提供するreCAPTCHAサービスを使用して、このサイトのインターネット送信フォームを介した送信を保護します。このプラグインは、特定のWebサイト機能がスパムボットによって（ab）使用されるのを防ぐために、あなたが人であるかどうかをチェックします。このプラグインクエリには、IPアドレスの送信と、GoogleがGoogle reCAPTCHAサービスに必要とするその他のデータの送信が含まれます。この目的のために、入力はGoogleに伝達され、Googleによって使用されます。ただし、お客様のIPアドレスは、EU加盟国または欧州経済地域に関する協定の当事者である他の州では、Googleによって以前に切り捨てられており、匿名化されています。例外的な場合にのみ、完全なIPアドレスが米国のGoogleサーバーに送信され、そこで切り捨てられます。このウェブサイトの運営者を代表して、Googleはこの情報を使用して、このサービスの使用を評価します。ブラウザからreCaptchaが提供するIPアドレスは、Googleの他のデータとマージされません。
</p>

<h3>クッキーを管理する方法</h3>
<p>
    Cookieを受け入れないようにブラウザを設定できます。上記のWebサイトでは、ブラウザからCookieを削除する方法を説明しています。ただし、いくつかのケースでは、当社のウェブサイトの機能の一部が結果として機能しない場合があります。
</p>

<h3>他のWebサイトのプライバシーポリシー</h3>
<p>
    DISBOARD.org Webサイトには、他のWebサイトへのリンクが含まれています。当社のプライバシーポリシーは当社のウェブサイトにのみ適用されるため、別のウェブサイトへのリンクをクリックした場合、プライバシーポリシーをお読みください。
</p>

<h3>プライバシーポリシーの変更</h3>
<p>
    DISBOARDは、プライバシーポリシーを定期的に確認し、このWebページに更新を掲載します。このプライバシーポリシーは、ページの上部に記載されている日付に最終更新されました。


    DISBOARD keeps its privacy policy under regular review and places any updates on this web page. This privacy policy was last updated at the date noted at the top of the page.
</p>

<h3>お問い合わせ方法</h3>
<p>
    当社のプライバシーポリシー、保持しているデータについてご質問がある場合、またはデータ保護権のいずれかを行使する場合は、お気軽にお問い合わせください。<br>
    Discordサーバー: <a href="<?= Yii::$app->params['discordServer']['ja'] ?>"><?= Yii::$app->params['discordServer']['ja'] ?></a> (オーナー: Taki#0526) <br>
    （注意：お問い合わせの際は必ず内容を明記してください。内容が明記されていない場合はお問い合わせに応じることができません）
</p>

<h3>カリフォルニアの住民向け</h3>
<p>
    DISBOARDは、時間をかけてサードパーティのWebサイト全体で顧客を追跡してターゲット広告を提供しないため、追跡禁止（DNT）信号に応答しません。ただし、一部のサードパーティのサイトは、コンテンツを提供するときにブラウジングアクティビティを追跡するため、提供するものをカスタマイズできます。そのようなサイトにアクセスしている場合、ブラウザでDNTシグナルを有効にするのはあなたの責任です。
</p>

<h2>メンバーシップに対する不承認の権利</h2>
<p class="tos-summary">
    当社は登録を拒否できます。
</p>
<ul>
    <li>
        これらの規約に同意する人は誰でもDISBOARDに登録できます
    </li>
    <li>
        このサービスに申し込む人（以下「申込者」）は、申込を承諾するとユーザーになります。
    </li>
    <li>
        次の場合、理由を開示せずに申請者からの申請を拒否することができます。
        <ul>
            <li>
                申請者は、利用規約違反またはその他の理由により登録を削除された。
            </li>
            <li>
                当社が不適切と判断した。
            </li>
        </ul>
    </li>
</ul>

<h2>ユーザー環境の保全</h2>
<p class="tos-summary">
    あなたは自分のアカウント/所有物に対して単独で責任を負います。
</p>
<ul>
    <li>
        ユーザーは、ユーザーの費用と責任でこのサービスを使用するために必要なすべてのハードウェアを維持するものとします。
    </li>
    <li>
        ユーザーは、ウイルス、不正アクセス、または情報漏えいからデバイスを防ぐために適切な手段を講じなければなりません。
    </li>
    <li>
        私たちは、ユーザーの環境および個人の財産に関与または責任を負いません。
    </li>
</ul>

<h2>ユーザーの責任</h2>
<p class="tos-summary">
    あなたは自分の行動に対して単独で責任を負います。
</p>
<ul>
    <li>
        ユーザーは、このサービスを使用する責任を負い、このサービスの使用に起因する行動と結果に対して責任を負います。
    </li>
    <li>
        ユーザーは、このサービスに投稿するすべてのデータに対して全責任を負います。私たちはユーザーがサービスに投稿したコンテンツについては責任を負いません。
    </li>
    <li>
        ユーザーが名誉毀損をしたり、プライバシー権を侵害したり、第三者の情報を許可なく開示したり、著作権法に違反した場合、ユーザーはユーザーの責任と費用を解決する必要があります。私たちは責任を負いません。
    </li>
</ul>

<h2>禁止行為</h2>
<p class="tos-summary">
    このウェブサイトでしてはいけないことを以下に示します。
</p>
<p>
    このサービスでは、以下で説明する行為は禁止されています。
    ユーザーが禁止行為を行った場合、メンバーシップを終了または一時停止し、
    アカウントからデータの一部またはすべてを削除するか、ユーザーの公開制限を変更する場合があります。
    （ただし、私たちはこれらの措置を講じる義務はなく、これらの措置を講じた理由を開示する義務を負いません。）
</p>
<ul>
    <li>
        <a href="<?= Url::to(['/site/guidelines']) ?>">ガイドライン</a>に違反すること
    </li>
    <li>
        以下のデータを含むコンテンツを投稿すること
        <ul>
            <li>
                法律、規制に違反する児童ポルノまたは児童虐待。
            </li>
            <li>
                名誉毀損の原因となる情報。
            </li>
            <li>
                個人を特定できる情報。
            </li>
            <li>
                私たちが不適切と判断した情報。
            </li>
        </ul>
    </li>
    <li>
        作成者または当社の許可なしにこのサイトからデータを転載する。
    </li>
    <li>
        法律、道徳、条件またはその他の条件に違反する行為、または他者の権利を侵害すると判断する行為。
    </li>
    <li>
        サーバーの負荷を通常よりも長くしたり、サービス操作やネットワークシステムに損害を与えたりすること。
    </li>
    <li>
        その他、当社が不適切とみなした行動。
    </li>
</ul>

<h2>サービス変更</h2>
<p class="tos-summary">
    このサービスはいつでも変更/終了する可能性があり、私たちはその責任を負いません。
</p>
<ul>
    <li>
        当社は、予告なしにいつでもこのサービスを追加、変更、中断、および/または終了することがあります。
    </li>
    <li>
        当社は、このサービスの追加、変更、一時停止、または終了について責任を負いません。
    </li>
</ul>

<h2>料金</h2>
<p>
    DISBOARDは無料で使用できます。<br>
    プレミアムサービスが計画されています。その場合は、プレミアムサービスのサービス条件で別途説明します。
</p>

<h2>データ権</h2>
<p class="tos-summary">
    投稿するものはすべてあなたのものでなければなりません。紛争の場合あなたがそれに対処します。
</p>
<p>
    このサービスを使用してデータを投稿するユーザーは、データが第三者の権利を侵害しないことを保証するものとします。データの投稿により第三者の権利を侵害するなどの紛争が発生した場合、ユーザーはユーザーの責任と費用で紛争を解決する必要があります。ユーザーは当社にいかなる損害も与えません。
</p>

<h2>データライセンス</h2>
<p class="tos-summary">
    このサービスは私たちのものです。あなたは私たちにあなたのデータを使う許可を与えます。定期的に確認する場合があります。
</p>
<ul>
    <li>
        このサービスに付随する情報、サービス、プログラムなどに関する知的財産権およびその他の権利は当社に帰属します。
    </li>
    <li>
        このサービスに投稿されるすべてのデータは、テキストまたは画像を作成したユーザーの著作権です。DISBOARD Webサイトにデータを投稿すると、そのユーザーは、DISBOARD Webサイトで概説されているサービスを実行するために、そのデータを送信、保存、変更、および表示するための永久的で世界的なロイヤリティフリーの取消不能ライセンスを私たちに付与します。
    </li>
    <li>
        当社は、サービスの円滑な運用、および/または必要な範囲内でのシステムの構築、改善、保守のために、ユーザーが投稿したデータを使用および修正できます。
    </li>
</ul>

<h2>免責事項</h2>
<p class="tos-summary">
    損害については責任を負いません。見逃しは免除としてカウントされません。
</p>
<ul>
    <li>
        当社は、ユーザー間の紛争や誤解について当社に関心を持ちません。ユーザー間で紛争が発生した場合、ユーザーはユーザーの責任において解決する必要があります。ユーザー間の紛争や誤解については一切責任を負いません。
    </li>
    <li>
        必要と判断した場合は、いつでも予告なくサービスを修正、中断、または終了できます。このサービスの変更に起因する損害について、当社は一切責任を負いません。さらに、サーバーの過負荷またはその他の予期しない要因が原因でスローダウンまたは障害が発生した場合にも同じことが当てはまります。
    </li>
    <li>
        ユーザーが投稿したデータを管理または保存する義務はありません。
    </li>
    <li>
        Disboardは、ユーザーが作成またはサイトにアップロードしたコンテンツについて責任を負いません。Disboardは、違法または本規約に違反するコンテンツを削除するためのすべての合理的な措置を講じますが、Disboardは削除されないコンテンツに対して責任を負いません。
    </li>
    <li>
        ユーザーが規約に違反した、または規約に違反した可能性があることを裏付ける十分な理由があると判断した場合、メンバーシップを終了または一時停止し、データのすべてまたは一部を削除し、公開されたユーザーの制限を変更することがあります。この行為に起因する損害について、当社は一切責任を負いません。
    </li>
    <li>
        当社が本規約の権利または規定を行使または執行しなかったとしても、かかる権利または規定の権利放棄を構成するものではなく、いずれの当事者による本契約の違反または不履行の権利放棄は、先行または後続の権利放棄とはみなされません。
    </li>
</ul>

<h2>条件およびその他の条件の有効性</h2>
<p class="tos-summary">
    法律の一部、または民間契約が条件の特定の部分を否定する場合、他の部分はそのまま残ります。
</p>
<ul>
    <li>
        これらの規約の一部が管轄裁判所で無効であると判断された場合、これらの規約の残りの部分が完全に適用されます。
    </li>
    <li>
        ユーザーとの書面による契約で本規約の一部を無効にすることを決定した場合、本規約の残りの部分は引き続き完全な効力を持ちます。
    </li>
</ul>

<h2>禁止行為の手続き</h2>
<p class="tos-summary">
    これはあなたが私たちのルールを破ったときにあなたを罰するために私たちがすることです
</p>
<ul>
    <li>
        ユーザーがこれらの規約およびその他の利用規約などに違反していることが判明した場合、および必要と判断した場合は、以下の措置を講じることがあります。ただし、これらの措置を講じる義務はなく、これらの措置を講じた理由を開示する義務を負いません。
        <ul>
            <li>
                データの削除または修正の要求。
            </li>
            <li>
                データの一部またはすべてを削除し、公開範囲を変更するか、閲覧を無効にします。
            </li>
            <li>
                このサービスへのユーザーのアクセスを変更します。
            </li>
            <li>
                メンバーシップを終了するための強制実行。
            </li>
            <li>
                メンバーシップの受け入れの拒否。
            </li>
        </ul>
    </li>
    <li>
        ユーザーは当社の措置に異議を唱えないものとします。
    </li>
    <li>
        DISBOARDは、このセクションで説明されているアクションを実行する際に、ユーザーと補償または交渉する義務を負いません。
    </li>
</ul>
